bookstore_app/app/controllers/books_controller.rb

    def create
        /render plain: params[:book].inspect/
        @book = Book.new(book_params)
        @book.save
---
INSERT INTO `books` (`title`, `price`, `book_id`, `publisher`, `description`, `number`, `created_at`, `updated_at`) VALUES ('z', 1.0, 'a', 'a', 'a', '2', '2021-02-21 09:26:39.113414', '2021-02-21 09:26:39.113414')